/* 
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer: การเรียกใช้ซ้ำได้หลายครั้งในแต่ละสถานการณ์ เพราะเราแค่จำเป็นต้องสร้าง function หลัก และ callback สำหรับเรียกมาใช้แค่ครั้งเดียว
แล้วเราก็สามารถเรียกมาใช้ได้เรื่อยๆตามสถานการณ์ที่เจอลดความซ้ำซ้อนในการเขียนโปรแกรม

2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร 
Answer: คิดว่าอ่านง่ายขึ้นครับ เพราะว่าเราสามารถใช้ HOF ตัวนึง ที่ตั้งไว้ว่าจะให้เป็น function ที่ใช้ตอนต้องการแจ้งเตือน และเรียกใช้ callback ตามสถานการณ์ที่ player เจอ

3. หากต้องสอนเพื่อนให้เข้าใจ Callback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร 
Answer: Callback คือ Function ตัวนึงที่จะสามารถเรียกมาใช้ซ้ำได้ตามสถานการณ์ Higher-Order Function คือ function หลักที่เรียกใช้ Callback อีกทีนึง
สมมติว่า Callback คือการบวกเลขหรือลบเลข เราก็แค่เรียกใช้ Higher-Order Function แล้วใส่ Argument เป็นตัวเลขที่เราอยากหาค่า เช่น 2 กับ 4 และตามด้วย Callback ว่า
ต้องการให้เลขสองตัวหน้าเอาไปหาค่าแบบไหน 

*/
